<?php

return [
    'brand' => [
        'subtitle' => 'ابزاری برای دریافت اطلاعات آی پی',
    ],
    'ip' => [
        'card' => [
            'error' => 'در دریافت اطلاعات خطایی رخ داده است. برای تلاش مجدد بر روی دکمه زیر کلیک کنید.',
            'retry' => 'تلاش مجدد!',
        ],
        'info' => [
            'title' => 'آی پی عمومی شما در حال حاضر:',
            'btn' => 'عمومی',
            'location' => 'موقعیت جغرافیایی',
            'subnet' => 'Subnet',
        ],
        'table' => [
            'title' => 'اطلاعاتی که درمورد این آی پی می دانیم:',
            'ip' => 'آدرس آی پی',
            'ip_numeric' => 'آدرس آی پی عددی',
            'country' => 'کشور',
            'longitude' => 'طول جغرافیایی',
            'latitude' => 'عرض جغرافیایی',
            'asn' => 'ASN',
            'asn_org' => 'ASN (organization)',
            'hostname' => 'Hostname',
            'user_agent' => 'User agent',
            'user_agent_comment' => 'User agent: Comment',
            'user_agent_raw' => 'User agent: Raw',
        ],
        'api' => [
            'title' => 'از API ما اینگونه استفاده کنید!',
            'subtitle' => 'از طریق گزینه های زیر می توانید نحوه استفاده از هر مورد و نتیجه آن را مشاهده نمایید:',
            'items' => [
                'ip' => 'آی پی',
                'country' => 'کشور',
                'country_code' => 'کد کشور',
                'city' => 'شهر',
                'asn' => 'asn',
                'json' => 'json',
            ],
            'input' => [
                'title' => 'بررسی آی پی دیگر (اختیاری)',
                'check' => 'بررسی',
                'placeholder' => 'آی پی مورد نظر',
            ],
            'result_error' => 'خطا! لطفا مجدد امتحان کنید',
            'copied' => 'کپی شد',
        ],
    ],
    'faq' => [
        'title' => 'سوالات متداول',
        'questions' => [
            'چجوری میتونم مشخص کنم از کدام ورژن از آی پی استفاده شود؟',
            'چگونه میتوانم این اطلاعات رو به صورت JSON دریافت کنم؟',
            'آیا استفاده از این ابزار در برنامه ها مجاز است؟',
            'آیا میتوانم به صورت اختصاصی این ابزار را برای خودم راه اندازی کنم؟',
        ],
        'answers' => [
            'از سال 2018-07-25 مشخص کردن ورژن آی پی در پروتوکل ها منسوخ شده و امکان پذیر نمیباشد. ولیکن میتوانید در صورت داشتن امکان با استفاده از پارامتر درست در برنامه‌ای که استفاده میکنید، ورژن آی پی را تعیین کنید. برای مثال در فرمان curl میتوانید با پارامتر های 4- و 6- مشخص کنید از کدام ورژن آی پی که دارید استفاده شود.',
            'با تنظیم پارامتر هدر درخواست برابر application/json میتوانید اطلاعات را به صورت JSON دریافت کنید.',
            'بله، تا زمانی که تعداد درخواست های شما از حد معینی بیشتر نشود و فشار بر روی سرور های ما ایجاد نکند، میتوانید از این ابزار در برنامه ها استفاده کنید. در برنامه هایتان سعی کنید در هر دقیقه بیشتر از یک درخواست ارسال نکنید. در صورتیکه درخواست های شما بیشتر شود، تا مدتی از ایجاد درخواست جدید از طرف شما جلوگیری خواهد شد.',
            'بله، میتوانید با استفاده از شماره های تماس با ما در ارتباط باشید و ما ابزار اختصاصی خودتان را راه اندازی خواهیم کرد.',
        ],
    ],
    'contact' => [
        'title' => 'با ما در تماس باشید',
        'phone' => 'شماره تماس:',
        'email' => 'پست الکترونیک:',
        'support' => 'پشتیبانی فنی:',
        'click' => 'کلیک کنید',
    ],
    'links' => [
        'title' => 'ما را دنبال کنید در:',
        'dnj' => 'هلدینگ داده نگار جی',
        'jey' => 'جی سرور',
        'webshot' => 'وب شات',
        'jeodns' => 'JeoDns',
    ],
];
